package com.example.sapeu.learnrecyclerview;

import android.support.v7.widget.RecyclerView;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

/**
 * Created by Sapeu on 2016/8/16.
 */
class MyAdapter extends RecyclerView.Adapter {
    class RecyclerViewViewHolder extends RecyclerView.ViewHolder {
        private View root;
        private TextView textContent,textTitle;

        public RecyclerViewViewHolder(View root) {
            super(root);
            textTitle = (TextView) root.findViewById(R.id.text_title);
            textContent = (TextView) root.findViewById(R.id.text_content);
        }

        public TextView getTextContent() {
            return textContent;
        }

        public void setTextContent(TextView textContent) {
            this.textContent = textContent;
        }

        public TextView getTextTitle() {
            return textTitle;
        }

        public void setTextTitle(TextView textTitle) {
            this.textTitle = textTitle;
        }
    }

    /**
     * @param parent   ViewGroup
     * @param viewType 类型
     * @return 创建View Holder的方法
     */
    @Override
    public RecyclerView.ViewHolder onCreateViewHolder(ViewGroup parent, int viewType) {
        //LayoutInflater布局解释器
        //LayoutInflater.from(context).inflate((资源,根对象)
        return new RecyclerViewViewHolder(LayoutInflater.from(parent.getContext()).inflate(R.layout.list_cell,null));
    }

    /**
     * 绑定View Holder的方法
     *
     * @param holder   通过onCreateViewHolder方法创建的RecyclerView.ViewHolder
     * @param position 索引
     */
    @Override
    public void onBindViewHolder(RecyclerView.ViewHolder holder, int position) {
        RecyclerViewViewHolder viewHolder = (RecyclerViewViewHolder) holder;
        CellData cellData = cellDatas[position];
        viewHolder.getTextContent().setText(cellData.getContent());
        viewHolder.getTextTitle().setText(cellData.getTitle());
    }

    /**
     * @return 创建recyclerView的子对象有10个
     */
    @Override
    public int getItemCount() {
        return cellDatas.length;
    }

    private CellData[] cellDatas = new CellData[]{new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！"),new CellData("雁邱词","问世间情是何物，直教生死相许。 \n" +
            "天南地北双飞客，老翅几回寒暑。 \n" +
            "欢乐趣，离别苦，就中更有痴儿女。 \n" +
            "君应有语，渺万里层云，千山暮雪，只影向谁去。\n" +
            "横汾路，寂寞当年箫鼓，荒烟依旧平楚。 \n" +
            "招魂楚些何嗟及，山鬼暗啼风雨。 \n" +
            "天也妒，未信与，莺儿燕子俱黄土。 \n" +
            "千秋万古，为留待骚人，狂歌痛饮，来访雁邱处。"),new CellData("蝶恋花","伫倚危楼风细细，望极春愁，黯黯生天际。\n" +
            "草色烟光残照里，无言谁会凭栏意。\n" +
            "拟把疏狂图一醉，对酒当歌，强乐还无味。\n" +
            "衣带渐宽终不悔，为伊消得人憔悴。"),new CellData("鹊桥仙","纤云弄巧，飞星传恨，银汉迢迢暗度。\n" +
            "金风玉露一相逢，便胜却、人间无数。\n" +
            "柔情似水，佳期如梦，忍顾鹊桥归路！\n" +
            "两情若是久长时，又岂在、朝朝暮暮！")};
}
